Revit 2026 API

# SolidOptionsMaterialId Property

---

Defines the material id for the Solid.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId MaterialId { get; set; }
```
```vb
Public Property MaterialId As ElementId
	Get
	Set
```
```cpp
public:
property ElementId^ MaterialId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```
```fsharp
member MaterialId : ElementId with get, set
```

#### Property Value

ElementId

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

SolidOptions Class

Autodesk.Revit.DB Namespace